Revit 2026 API

# OpenOptionsAudit Property

---

Specifies whether to expand all elements in order to check for corruption.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Audit { get; set; }
```
```vb
Public Property Audit As Boolean
	Get
	Set
```
```cpp
public:
property bool Audit {
	bool get ();
	void set (bool value);
}
```
```fsharp
member Audit : bool with get, set
```

#### Property Value

Boolean

The default is false. Setting this to true will increase the time and memory required to open the file.

#### Reference

OpenOptions Class

Autodesk.Revit.DB Namespace